# frozen_string_literal: true

class StemmerRu
  ONE_SYLLABLE = /.*[аеиоуыэюя].*$/.freeze
  TWO_SYLLABLES = /.*[аеиоуыэюя].*[аеиоуыэюя].*$/.freeze
  THREE_SYLLABLES = /.*[аеиоуыэюя].*[аеиоуыэюя].*[аеиоуыэюя].*$/.freeze

  PERFECTIVEGERUND = /((ив|ивши|ившись|ыв|ывши|ывшись)|((?<=[ая])(в|вши|вшись)))$/.freeze
  PERFECTIVEGERUND1 = /[ая](в|вши|вшись)$/.freeze
  PERFECTIVEGERUND2 = /(ив|ивши|ившись|ыв|ывши|ывшись)$/.freeze
  REFLEXIVE = /(с[яь])$/.freeze
  ADJECTIVE = /(ее|ие|ые|ое|ими|ыми|ей|ий|ый|ой|ем|им|ым|ом|его|ого|ему|ому|их|ых|ую|юю|ая|яя|ою|ею)$/.freeze
  PARTICIPLE = /((ивш|ывш|ующ)|((?<=[ая])(ем|нн|вш|ющ|щ)))$/.freeze
  VERB = /((ила|ыла|ена|ейте|уйте|ите|или|ыли|ей|уй|ил|ыл|им|ым|ен|ило|ыло|ено|ят|ует|уют|ит|ыт|ены|ить|ыть|ишь|ую|ю)|
          ((?<=[ая])(ла|на|ете|йте|ли|й|л|ем|н|ло|но|ет|ют|ны|ть|ешь|нно)))$/.freeze
  NOUN = /(а|ев|ов|ие|ье|е|иями|ями|ами|еи|ии|и|ией|ей|ой|ий|й
          |иям|ям|ием|ем|ам|ом|о|у|ах|иях|ях|ы|ь|ию|ью|ю|ия|ья|я)$/.freeze
  DERIVATIONAL = /.*[аеиоуыэюя].*[аеиоуыэюя].*ость?$/.freeze
  SUPERLATIVE = /(ейше|ейш)$/.freeze
end
